Revit 2027 API
BindingMap.Remove Method
 The Remove method is used to remove a parameter binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Remove(
	Definition key
)
Public Overridable Function Remove (
	key As Definition
) As Boolean
public:
virtual bool Remove(
	Definition^ key
)
abstract Remove :
        key : Definition -> bool
override Remove :
        key : Definition -> bool
Parameters
key Definition
 A parameter definition which can be an existing definition or one from a shared parameters file.
Return Value
Boolean
See Also
Reference
BindingMap Class
Autodesk.Revit.DB Namespace